src/Services/Air/templates/AirRetrieveDocument.xml

<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:air="http://www.travelport.com/schema/air_v39_0"
  xmlns:com="http://www.travelport.com/schema/common_v39_0"
  >
  <soapenv:Header/>
  <soapenv:Body>
    <air:AirRetrieveDocumentReq AuthorizedBy="user" TargetBranch="{{TargetBranch}}" RetrieveProviderReservationDetails="false" ReturnRestrictions="false" ReturnPricing="false" RetrieveMCO="false" ProviderCode="1G">
      <com:BillingPointOfSaleInfo OriginApplication="uAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
      {{#if emulatePcc}}
      <com:OverridePCC ProviderCode="1G" PseudoCityCode="{{emulatePcc}}"/>
      {{/if}}
      <com:TicketNumber>{{ticketNumber}}</com:TicketNumber>
    </air:AirRetrieveDocumentReq>
  </soapenv:Body>
</soapenv:Envelope>
